[
{"CVE_ID": "CVE-2000-0704", "Description": "Buffer overflow in SGI Omron WorldView Wnn allows remote attackers to\nexecute arbitrary commands via long JS_OPEN, JS_MKDIR, or JS_FILE_INFO\ncommands.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20000919"},
{"CVE_ID": "CVE-2014-2369", "Description": "Cross-site request forgery (CSRF) vulnerability in the web application\non Omron NS5, NS8, NS10, NS12, and NS15 HMI terminals 8.1xx through\n8.68x allows remote authenticated users to hijack the authentication\nof unspecified victims via unknown vectors.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20140313"},
{"CVE_ID": "CVE-2015-0988", "Description": "Omron CX-One CX-Programmer before 9.6 uses a reversible format for\npassword storage in project source-code files, which makes it easier\nfor local users to obtain sensitive information by reading a file.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20150110"},
{"CVE_ID": "CVE-2014-2370", "Description": "Cross-site scripting (XSS) vulnerability in the web application on\nOmron NS5, NS8, NS10, NS12, and NS15 HMI terminals 8.1xx through 8.68x\nallows remote authenticated users to inject arbitrary web script or\nHTML via crafted data.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20140313"},
{"CVE_ID": "CVE-2013-2301", "Description": "The OMRON OpenWnn application before 1.3.6 for Android uses weak\npermissions for unspecified files, which allows attackers to obtain\nsensitive information via an application that accesses the local\nfilesystem.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20130304"},
{"CVE_ID": "CVE-2015-0987", "Description": "Omron CX-One CX-Programmer before 9.6, CJ2M PLC devices before 2.1,\nand CJ2H PLC devices before 1.5 rely on cleartext password\ntransmission, which allows remote attackers to obtain sensitive\ninformation by sniffing the network during a PLC unlock request.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20150110"},
{"CVE_ID": "CVE-2015-1015", "Description": "Omron CX-One CX-Programmer before 9.6, CJ2M PLC devices before 2.1,\nand CJ2H PLC devices before 1.5 use a reversible format for password\nstorage in object files on Compact Flash cards, which makes it easier\nfor local users to obtain sensitive information by reading a file.", "Assigning_CNA": "N/A", "Date_Entry_Created": "20150110"}
]